var dict = {
	"ола": "привет",
	"ока": "пока",
	"ды": "да",
	"ны": "нет",
	"дед": "враг",
	"деды": "враги",
	"деда": "врага",
	"дедов": "врагов",
	"жираф": "предатель",
	"жирафы": "предатели",
	"жирафа": "предателя",
	"жирафов": "предателей",
	"бабу": "горячий",
	"дрошка": "страшно",
	"дрочка": "мужик",
	"дрочки": "мужики",
	"пальма": "дэвка",
	"пальмы": "дэвки",
	"обезьянка": "парень",
	"обезьянки": "парни",
	"цыпалька": "девушка",
	"цыпальки": "девушки",
	"хокаге": "тупая дэффка",
	"шлюпка": "шкура",
	"шлюпки": "шкуры",
	"светофор": "даун",
	"светофоры": "дауны",
	"светофора": "дауна",
	"светофоров": "даунов",
	"светофором": "дауном",
	"мухожук": "долбаип",
	"мухожуки": "долбаипы",
	"мухожука": "долбаипа",
	"мухожуков": "долбаипов",
	"мухожучно": "долбаипно",
	"баобабно": "классно",
	"баобабный": "классный",
	"сыс": "ага",
	"факаз": "хорошо",
	"майна": "жиза",
	"майнкрафт": "жизнь",
	"бравлить": "играть",
	"фьюнуть": "решить",
	"пукнуть": "предложить",
	"пукни": "предложи",
	"травамышь": "еда",
	"травамышить": "кушац",
	"травамышили": "кушали",
	"жоролет": "жиробасина",
	"жоролёт": "жиробасина",
	"жоролеты": "жиробасины",
	"жоролёты": "жиробасины",
	"жоролета": "жиробаса",
	"жоролёта": "жиробаса",
	"жоролетов": "жиробасов",
	"жоролётов": "жиробасов",
	"утка": "хакер",
	"утки": "хакеры",
	"уток": "хакеров",
	"пажилой": "умный",
	"пажилые": "умные",
	"пажилых": "умных",
	"молодой": "тупой",
	"молодые": "тупые",
	"молодых": "тупых",
	"буллочка": "силач",
	"буллочки": "силачи",
	"буллочек": "силачей",
	"здабул": "обманщик",
	"здабулы": "обманщики",
	"здабула": "обманщика",
	"здабулов": "обманщиков",
	"повар": "волк",
	"повары": "волки",
	"повара": "волка",
	"поваров": "волков",
	"поварами": "волками",
	"рычуля": "тигр",
	"рычули": "тигры",
	"рычулей": "тигров",
	"баом": "бутекоин",
	"баомы": "бутекоины",
	"киви": "саня",
	"маха": "макс"
};

var special = `[\[ \\\^\$\.\|\?\*\+\(\),:;=&#"'!/]`;

function change(id) {
	var msg = document.getElementById("baobab"),
		upd = document.getElementById("russia");
	
	switch(id) {
		case 0:
			if(dict["ола"]) dict = reverse(dict);
			msg.value = createWords(upd.value);
			break;
		case 1:
			if(dict["привет"]) dict = reverse(dict);
			upd.value = createWords(msg.value);
			break;
	}
}

function reverse(old) {
	return Object.keys(old).reduce(function(obj, key){
		obj[old[key]] = key;
		return obj;
	}, {});
}

function createWords(str) {
	str = " " + str + " ";
	for (const [key, value] of Object.entries(dict)) {
		let reg = new RegExp(special + `${key}` + special, "gi");
		str = str.replace(reg, function(match, pars, offset) {
			var current = match.substring(1, match.length - 1);
			var replacement = current == key ? value : current == key.toUpperCase() ? value.toUpperCase() : value.slice(0, 1).toUpperCase() + value.slice(1);
			return match.replace(current, replacement);
		});
	}
	return str.substring(1, str.length - 1);
}
